<?php
require_once('../odoo_server.php');
require_once('./individual.php');

// Реєстрація на подію, також можливий запис з купивлею білету на сайті
$r = array(
    'id'=>'9225', // унікальний ID запису реєстрації 
    'customer'=>array(
        'id'=>12345, // унікальний ID користувача, що записуюється на подію
        'name'=>'Gabriela Bieda', // Ім'я та призвище користувача
        'email'=>'gabriela.bieda1@gmail.com', // емейл користвача
        'phone'=>'48790707130' // телефон користувача (базажно задавати телефон лише цифрами без рисочок, пропусків, дужок тощо)
    ),
    'jaunt'=> array(
        'id'=>'133',
        // дата надається у вігляді рядка у форматі '%Y-%m-%d %H:%M:%S'
        // тут треба враховувати, що час серверу виставлений в UTC
        // тому для корректного відображення часу його треба передавати на 
        // дві години більше
        'date_begin'=>"2018-11-29 17:00:00",
        'is_individual'=>true,
        'language'=>array(
            'id'=>1, // унікальний ID мови проведення події
            'name'=>'Українська', // Текстова назва мови
        ),
        'catalog'=>array(
            'id'=>1, // унікальний ID продукту в каталозі
            'name'=>'НЕкласичний Львів', // Назва продукту в каталозі
        ), 
    ),
    'is_paid'=> true, // true, якщо білент був оплачений на сайті, false, якщо ні
    'price'=> 100,
    'comment'=>'Подробности заказа'
);

insert_order($server, $r);
